; domain
(define (domain logistics)
    (:predicates 
        (truck-at-location ?x - location)
        (package-at-location ?x - location ?y - package)
        (package-loaded ?x - package)
    )   

    (:types 
        location package - object
    )

    (:action travel
        :parameters (?from - location ?to - location)
        :precondition (and (truck-at-location ?from))
        :effect (and 
                (truck-at-location ?to) 
            (not 
                (truck-at-location ?from)
            ))    
    )

    (:action load
        :parameters (?location - location ?package - package)
        :precondition (and (truck-at-location ?location) (package-at-location ?location ?package))
        :effect (and 
                    (package-loaded ?package)
                (not 
                    (package-at-location ?location ?package)
                ))
    )    

    (:action unload
        :parameters (?location - location ?package - package)
        :precondition (and (truck-at-location ?location) (package-loaded ?package))
        :effect (and 
                    (package-at-location ?location ?package)
                (not 
                    (package-loaded ?package)
                ))
    )
)

; problem
(define (problem logistics3)
    (:domain logistics)

    (:objects 
        tampines - location
        changi - location
        bedok - location
        package1 - package
        package2 - package
    )

    (:init
        (truck-at-location tampines)
        (package-at-location bedok package1)
        (package-at-location changi package2)
    )

    (:goal (and
                (package-at-location changi package1)
                (package-at-location bedok package2)
        )
    )
)

; plan
1. (travel tampines bedok)
   deleted: (truck-at-location tampines)
   added: (truck-at-location bedok)
   goals met: 0 of 2
2. (load bedok package1)
   deleted: (package-at-location bedok package1)
   added: (package-loaded package1)
   goals met: 0 of 2
3. (travel bedok changi)
   deleted: (truck-at-location bedok)
   added: (truck-at-location changi)
   goals met: 0 of 2
4. (unload changi package1)
   deleted: (package-loaded package1)
   added: (package-at-location changi package1)
   goals met: 1 of 2
5. (load changi package2)
   deleted: (package-at-location changi package2)
   added: (package-loaded package2)
   goals met: 1 of 2
6. (travel changi bedok)
   deleted: (truck-at-location changi)
   added: (truck-at-location bedok)
   goals met: 1 of 2
7. (unload bedok package2)
   deleted: (package-loaded package2)
   added: (package-at-location bedok package2)
   goals met: 2 of 2
